; domain
;domain file for the problem 3.1 of the assigment
;definition of the emergency-service scenario

; ---------------------------------------------------

(define (domain emergency-service)
    (:requirements :strips :typing :conditional-effects :negative-preconditions) 

    (:types 

        location locatable content_type - object
        owner robot content - locatable
        person box - owner
    ) 

    (:constants
        
        agent - robot
        depot - location
        food medicine tool - content_type
    )

    (:predicates
        
        (at ?o - locatable ?l - location) ; locatable object is at location
        (owns ?o - owner ?c - content) ; owner (person or box) owns the content
        (needs ?p - person ?t - content_type) ; person needs content of given type
        (instance_of ?c - content ?t - content_type) ; content is instance of given type
        (carries ?r - robot ?b - box) ; robot is carrying the box
        
        (safe ?p - person) ; all person's needs are satisfied
        (free ?r - robot) ; robot is not carrying any boxes
        (empty ?b - box) ; box is empty (has no contents)
        (loadable ?b - box) ; box can be loaded (no robot has loaded it yet)
        (available ?c - content) ; content can be picked up
    )

    ; NOTE: we assume the robot might fill a box without picking it up
    ; fill a single box, if the box is empty and content, box and agent are all at the same location
    (:action fill
        :parameters (?r - robot ?b - box ?c - content ?t - content_type ?l - location)
        :precondition (and 
            (at ?r ?l) (at ?b ?l) (at ?c ?l) (empty ?b) (available ?c) (instance_of ?c ?t)
            ; fill box only with content that someone needs
            (exists (?p - person) (needs ?p ?t))
        ) 
        :effect (and (owns ?b ?c) (not (empty ?b)) (not (available ?c)))
    )

    ; NOTE: seems reasonable to assume that a robot can empty only the box it carries
    ; NOTE: we also assume the box to be still loaded on the robot after emptying
    ; empty a box by dropping the content at the current location, and causing the people at the same location to have the content
    (:action empty
        :parameters (?r - robot ?b - box ?c - content ?t - content_type ?l - location)
        :precondition (and 
            (at ?r ?l) (at ?b ?l) (at ?c ?l) (carries ?r ?b) (owns ?b ?c) (instance_of ?c ?t)
            ; empty box at location only if content is needed by someone there
            (exists (?p - person) (and (at ?p ?l) (needs ?p ?t))) 
        )
        :effect (and
            (empty ?b) (not (owns ?b ?c))
            ; people is plural, so we assume amount of content in a box is big enough for many people
            ; thus we also assume they will all get the content of the box, if they need it
            (forall (?p - person) (when (at ?p ?l) (and (owns ?p ?c) (not (needs ?p ?t)))))
        )
    )

    ; pick up a single box and load it on the robotic agent, if it is at the same location as the box (when box is empty)
    (:action pickup_empty
        :parameters (?r - robot ?b - box ?l - location)
        :precondition (and (at ?r ?l) (at ?b ?l) (free ?r) (loadable ?b) (empty ?b))
        :effect (and (carries ?r ?b) (not (free ?r)) (not (loadable ?b)))
    )

    ; pick up a single box and load it on the robotic agent, if it is at the same location as the box (when box is full)
    (:action pickup_full
        :parameters (?r - robot ?b - box ?c - content ?t - content_type ?l - location)
        :precondition (and 
            (at ?r ?l) (at ?b ?l) (at ?c ?l) (free ?r) (loadable ?b) (owns ?b ?c) (instance_of ?c ?t)
            ; pick up a full box only if its content is needed by someone
            (exists (?p - person) (needs ?p ?t)) 
        )
        :effect (and (carries ?r ?b) (not (free ?r)) (not (loadable ?b)))
    )

    ; move to another location (if no box has been loaded)
    (:action move_free
        :parameters (?r - robot ?from - location ?to - location)
        :precondition (and (at ?r ?from) (free ?r))
        :effect (and (not (at ?r ?from)) (at ?r ?to))
    )  

    ; move to another location (if a box has been loaded and it's empty)
    (:action move_loaded_empty
        :parameters (?r - robot ?b - box ?from - location ?to - location)
        :precondition (and (at ?r ?from) (at ?b ?from) (carries ?r ?b) (empty ?b))
        :effect (and 
            (not (at ?r ?from)) (at ?r ?to) 
            (not (at ?b ?from)) (at ?b ?to)
        )
    )

    ; move to another location (if a box has been loaded and it's full)
    (:action move_loaded_full
        :parameters (?r - robot ?b - box ?c - content ?from - location ?to - location)
        :precondition (and (at ?r ?from) (at ?b ?from) (at ?c ?from) (carries ?r ?b) (owns ?b ?c))
        :effect (and 
            (not (at ?r ?from)) (at ?r ?to) 
            (not (at ?b ?from)) (at ?b ?to) 
            (not (at ?c ?from)) (at ?c ?to)
        )
    )     

    ; NOTE: no explicit mention to deliver only boxes that are full

    ; deliver a box to a specific person who is at the same location (when box is empty)
    (:action deliver_empty
        :parameters (?r - robot ?b - box ?p - person ?l - location)
        :precondition (and (at ?r ?l) (at ?b ?l) (at ?p ?l) (carries ?r ?b) (empty ?b))
        :effect (and (free ?r) (loadable ?b) (not (carries ?r ?b)))
    )

    ; deliver a box to a specific person who is at the same location (when box is full)
    (:action deliver_full
        :parameters (?r - robot ?b - box ?c - content ?p - person ?l - location)
        :precondition (and (at ?r ?l) (at ?b ?l) (at ?c ?l) (at ?p ?l) (carries ?r ?b) (owns ?b ?c))
        :effect (and (free ?r) (loadable ?b) (not (carries ?r ?b)))
    )

    ; change status of a person to safe whenever all needs are satisfied
    (:action check_safe
        :parameters (?p - person)
        :precondition (and (not (safe ?p)) (not (exists (?t - content_type) (needs ?p ?t))))
        :effect (and (safe ?p))
    )
)

; problem
(define (problem problem_one) (:domain emergency-service)

(:objects 
    
    b1 b2 - box
    l1 l2 l3 - location
    c1 c2 c3 c4 c5 c6 - content
    gizem daria indira savannah luca - person
)

(:init
    
    (at gizem l1) (needs gizem medicine)
    (at daria l2) (needs daria medicine) (needs daria food)
    (at indira l3) (needs indira tool) (needs indira food)
    (at savannah l3) (needs savannah tool) (needs savannah food) (needs savannah medicine)
    (at luca depot) (safe luca)

    (at b1 depot) (empty b1) (loadable b1) 
    (at b2 depot) (empty b2) (loadable b2)

    (at c1 depot) (available c1) (instance_of c1 food)
    (at c2 depot) (available c2) (instance_of c2 food)
    (at c3 depot) (available c3) (instance_of c3 medicine)
    (at c4 depot) (available c4) (instance_of c4 medicine)
    (at c5 depot) (available c5) (instance_of c5 medicine)
    (at c6 depot) (available c6) (instance_of c6 tool)

    (at agent depot) (free agent)
)

(:goal (and

    ; all people needs are successfully satified
    (forall (?p - person) (safe ?p))

    ;; -----------------------------------------------------------------------
    ;; additional goal: make agent return to depot to be ready for new tasks
    (at agent depot)
))

)

; plan
1. (pickup_empty agent b2 depot)
   deleted: (free agent) (loadable b2)
   added: (carries agent b2)
   goals met: 1 of 2
2. (fill agent b2 c5 medicine depot)
   deleted: (empty b2) (available c5)
   added: (owns b2 c5)
   goals met: 1 of 2
3. (move_loaded_full agent b2 c5 depot l1)
   deleted: (at agent depot) (at b2 depot) (at c5 depot)
   added: (at agent l1) (at b2 l1) (at c5 l1)
   goals met: 0 of 2
4. (empty agent b2 c5 medicine l1)
   deleted: (owns b2 c5) (needs gizem medicine)
   added: (empty b2) (owns gizem c5)
   goals met: 0 of 2
5. (check_safe gizem)
   added: (safe gizem)
   goals met: 0 of 2
6. (move_loaded_empty agent b2 l1 depot)
   deleted: (at agent l1) (at b2 l1)
   added: (at agent depot) (at b2 depot)
   goals met: 1 of 2
7. (fill agent b1 c4 medicine depot)
   deleted: (empty b1) (available c4)
   added: (owns b1 c4)
   goals met: 1 of 2
8. (fill agent b2 c2 food depot)
   deleted: (empty b2) (available c2)
   added: (owns b2 c2)
   goals met: 1 of 2
9. (move_loaded_full agent b2 c2 depot l3)
   deleted: (at agent depot) (at b2 depot) (at c2 depot)
   added: (at agent l3) (at b2 l3) (at c2 l3)
   goals met: 0 of 2
10. (empty agent b2 c2 food l3)
   deleted: (owns b2 c2) (needs indira food) (needs savannah food)
   added: (empty b2) (owns indira c2) (owns savannah c2)
   goals met: 0 of 2
11. (move_loaded_empty agent b2 l3 depot)
   deleted: (at agent l3) (at b2 l3)
   added: (at agent depot) (at b2 depot)
   goals met: 1 of 2
12. (fill agent b2 c6 tool depot)
   deleted: (empty b2) (available c6)
   added: (owns b2 c6)
   goals met: 1 of 2
13. (move_loaded_full agent b2 c6 depot l3)
   deleted: (at agent depot) (at b2 depot) (at c6 depot)
   added: (at agent l3) (at b2 l3) (at c6 l3)
   goals met: 0 of 2
14. (empty agent b2 c6 tool l3)
   deleted: (owns b2 c6) (needs indira tool) (needs savannah tool)
   added: (empty b2) (owns indira c6) (owns savannah c6)
   goals met: 0 of 2
15. (check_safe indira)
   added: (safe indira)
   goals met: 0 of 2
16. (move_loaded_empty agent b2 l3 depot)
   deleted: (at agent l3) (at b2 l3)
   added: (at agent depot) (at b2 depot)
   goals met: 1 of 2
17. (fill agent b2 c1 food depot)
   deleted: (empty b2) (available c1)
   added: (owns b2 c1)
   goals met: 1 of 2
18. (move_loaded_full agent b2 c1 depot l2)
   deleted: (at agent depot) (at b2 depot) (at c1 depot)
   added: (at agent l2) (at b2 l2) (at c1 l2)
   goals met: 0 of 2
19. (empty agent b2 c1 food l2)
   deleted: (owns b2 c1) (needs daria food)
   added: (empty b2) (owns daria c1)
   goals met: 0 of 2
20. (move_loaded_empty agent b2 l2 depot)
   deleted: (at agent l2) (at b2 l2)
   added: (at agent depot) (at b2 depot)
   goals met: 1 of 2
21. (fill agent b2 c3 medicine depot)
   deleted: (empty b2) (available c3)
   added: (owns b2 c3)
   goals met: 1 of 2
22. (move_loaded_full agent b2 c3 depot l3)
   deleted: (at agent depot) (at b2 depot) (at c3 depot)
   added: (at agent l3) (at b2 l3) (at c3 l3)
   goals met: 0 of 2
23. (empty agent b2 c3 medicine l3)
   deleted: (owns b2 c3) (needs savannah medicine)
   added: (empty b2) (owns indira c3) (owns savannah c3)
   goals met: 0 of 2
24. (check_safe savannah)
   added: (safe savannah)
   goals met: 0 of 2
25. (deliver_empty agent b2 savannah l3)
   deleted: (carries agent b2)
   added: (free agent) (loadable b2)
   goals met: 0 of 2
26. (move_free agent l3 depot)
   deleted: (at agent l3)
   added: (at agent depot)
   goals met: 1 of 2
27. (pickup_full agent b1 c4 medicine depot)
   deleted: (free agent) (loadable b1)
   added: (carries agent b1)
   goals met: 1 of 2
28. (move_loaded_full agent b1 c4 depot l2)
   deleted: (at agent depot) (at b1 depot) (at c4 depot)
   added: (at agent l2) (at b1 l2) (at c4 l2)
   goals met: 0 of 2
29. (empty agent b1 c4 medicine l2)
   deleted: (owns b1 c4) (needs daria medicine)
   added: (empty b1) (owns daria c4)
   goals met: 0 of 2
30. (check_safe daria)
   added: (safe daria)
   goals met: 1 of 2
31. (move_loaded_empty agent b1 l2 depot)
   deleted: (at agent l2) (at b1 l2)
   added: (at agent depot) (at b1 depot)
   goals met: 2 of 2
